Autodesk.Revit.DB.BIMExportOptions.CanSetExportGeometry(System.Boolean)
Checks if the property ShouldExportGeometry can be modified to the provided value.
Returns:
The property ShouldExportGeometry can be modified to the provided value.
Since:
2023

Autodesk.Revit.DB.BIMExportOptions.SetElementFilter(Autodesk.Revit.DB.ElementFilter)
filter:
The ElementFilter. A copy is stored, or pass null to remove the existing filter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The options are not valid.
Since:
2023

Autodesk.Revit.DB.BIMExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BIMExportOptions.ShouldExportParameters
Indicates if the export should include parameter information.
Since:
2023

Autodesk.Revit.DB.BIMExportOptions.ShouldExportGeometry
Indicates if the export should include geometry.
Since:
2023

Autodesk.Revit.DB.BIMExportOptions.ElementFilter
The filter used screen exported elements. Elements that do not pass the filter are excluded from export.
Null by default, indicating that no elements are excluded.
Since:
2023

Autodesk.Revit.DB.BIMExportOptions.ViewId
The element id of the 3D view to export. InvalidElementId by default.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021.1

Autodesk.Revit.DB.BIMExportOptions
The base class for options used to export using ATF.
Since:
2021.1